app/Http/Controllers/Auth/Admin/OfferManagementController.php

select * from `offers`
---
    public function index()
    {
        //
        $offers = Offer::all();

update `offers` set `name` = 'Amity Stephenson', `start_date` = '1998-09-19 00:00:00', `end_date` = '2008-06-21 00:00:00', `agency_price` = '414', `user_price` = '344', `no_rooms` = '632', `status` = '0', `agency_id` = '1', `offers`.`updated_at` = '2020-04-26 21:19:31' where `id` = 1
---
    public function update(Request $request, $id)
    {
        //
        $this->validator($request->all())->validate();
        $offer = Offer::find($id);
        $offer->update([
           'name' => $request['name'],
           'start_date' => $request['start_date'],
           'end_date' => $request['end_date'],
           'agency_price' => $request['agency_price'],
           'user_price' => $request['user_price'],
           'no_rooms' => $request['no_rooms'],
           'status' => $request['status'],
           'agency_id'=>$request['agency'],


       ]);