app/Http/Controllers/agency/OfferController.php

    public function store(Request $request)
    {
        //
       $this->validator($request->all())->validate();

       $offer= Auth::guard('webagency')->user()->offers()->create([
            'name' => $request['name'],
            'start_date' => $request['start_date'],
            'end_date' => $request['end_date'],
            'agency_price' => $request['agency_price'],
            'user_price' => $request['user_price'],
            'no_rooms' => $request['no_rooms'],
            'status' => $request['status'],
                   ]);

            // get last offer inserted id
        $offer_id = Offer::latest()->first()->id;
---
select * from `offers` order by `created_at` desc limit 1

    public function update(Request $request, $id)
    {
        //
        $this->validator($request->all())->validate();
        $offer = Offer::find($id);
        $offer->update([
           'name' => $request['name'],
           'start_date' => $request['start_date'],
           'end_date' => $request['end_date'],
           'agency_price' => $request['agency_price'],
           'user_price' => $request['user_price'],
           'no_rooms' => $request['no_rooms'],
           'status' => $request['status'],

       ]);
---
update `offers` set `name` = 'Imelda Floyd', `start_date` = '1973-10-22 00:00:00', `end_date` = '2013-10-18 00:00:00', `agency_price` = '762', `user_price` = '206', `no_rooms` = '47', `status` = '1', `offers`.`updated_at` = '2020-04-26 17:34:00' where `id` = 61